InformationRegisters/СведенияОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбЭЛН</Name>
			<Comment>Сведения об электронных листках нетрудоспособности</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Comment>Заполняется при получении ЭЛН, при отправке реестров и при обновлении Хэша ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмененияПринятыФСС</Name>
					<Comment>Актуализируется при проведении больничных, включается при отправке реестров.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодготовленныйКОтправкеРеестр</Name>
					<Comment>Заполняется при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрДанныхЭЛНЗаполняемыхРаботодателем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятыйРеестр</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрДанныхЭЛНЗаполняемыхРаботодателем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеОтправки</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭЛНВРеестрахЭЛН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеФСС</Name>
					<Comment>АПК:58 Обратная совместимость.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭЛНВФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступенИсходныйXML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПричиныИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПричиныИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервичногоЛН</Name>
					<Comment>Заполняется при получении ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаменяемогоЛН</Name>
					<Comment>Заполняется при получении ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящийЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросФССДляРасчетаПособия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветНаЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОСтраховомСлучае</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщениеОСтраховомСлучаеФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяРеестрЭЛН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Больничный</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБольничного</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНетрудоспособности</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНетрудоспособностиНачало</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНетрудоспособностиОкончание</Name>
					<Comment>Заполняется при получении ЭЛН и при проведении больничных.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленныйРеестр</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрДанныхЭЛНЗаполняемыхРаботодателем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКСостоянию</Name>
					<Comment>Заполняется при отправке ЭЛН и при проведении реестров.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БольничныйПроведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерЛисткаНетрудоспособности</Name>
					<Comment>Заполняется при получении ЭЛН.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЭЛНВРеестрахЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СостоянияЭЛНВРеестрахЭЛН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЭЛНВФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СостоянияЭЛНВФСС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленНаМСЭ</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополненДаннымиМСЭ</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятРеестрЭЛН</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятРеестрПВСО</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченФСС</Name>
					<Comment>АПК:58 Стандартом "Имя, синоним, комментарий" допускаются ситуации, когда имя более кратко описывает объект, чем синоним.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
					<Comment>АПК:58 Имя более точно отражает суть состояния, но синоним, для исключения разночтений, должен соответствовать спецификации.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОбЭЛН/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перечисления.ПричиныНетрудоспособности.ДобавитьВФормуСпискаПредставлениеСтарыхПричин(
		Список,
		"ПричинаНетрудоспособности",
		"ПричинаНетрудоспособности",
		"ДатаНачалаСобытия");
	
	УстановитьСвойствоСпискаПоПараметруФормы("РежимВыбора");
	УстановитьСвойствоСпискаПоПараметруФормы("ВыборГруппИЭлементов");
	УстановитьСвойствоСпискаПоПараметруФормы("МножественныйВыбор");
	УстановитьСвойствоСпискаПоПараметруФормы("ТекущаяСтрока");
	
	Если ЗначениеЗаполнено(Параметры.Организация) И Не Параметры.Отбор.Свойство("ГоловнаяОрганизация") Тогда
		Параметры.Отбор.Вставить("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Параметры.Организация));
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Сотрудник) И Не Параметры.Отбор.Свойство("ФизическоеЛицо") Тогда
		Поля = "ГоловнаяОрганизация, ФизическоеЛицо";
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Ложь, Параметры.Сотрудник, Поля, ТекущаяДатаСеанса());
		Если КадровыеДанные <> Неопределено Тогда
			Если ЗначениеЗаполнено(КадровыеДанные.ГоловнаяОрганизация) Тогда
				Параметры.Отбор.Вставить("ГоловнаяОрганизация", КадровыеДанные.ГоловнаяОрганизация);
			КонецЕсли;
			Если ЗначениеЗаполнено(КадровыеДанные.ФизическоеЛицо) Тогда
				Параметры.Отбор.Вставить("ФизическоеЛицо", КадровыеДанные.ФизическоеЛицо);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.Список.РежимВыбора Тогда
		Элементы.ФормаВыбрать.КнопкаПоУмолчанию = Истина;
		Элементы.ПолучитьНовыеСообщения.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	КонецЕсли;
	
	Если Элементы.Список.МножественныйВыбор Тогда
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный;
	Иначе
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	КонецЕсли;
	
	ВыбранныеНомераЭЛН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВыбранныеНомераЭЛН");
	Если ТипЗнч(ВыбранныеНомераЭЛН) <> Тип("Массив") Тогда
		ВыбранныеНомераЭЛН = Новый Массив;
	КонецЕсли;
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(Список, "");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "НомерЛисткаНетрудоспособности", ВидСравненияКомпоновкиДанных.ВСписке, ВыбранныеНомераЭЛН);
	ИдентификаторСпискаПодобранных = Список.УсловноеОформление.ПолучитьИдентификаторПоОбъекту(ЭлементУО);
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(Список, "ДатаОтправки, СостояниеОтправки, КомментарийКСостоянию");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "СостояниеОтправки", "=", Перечисления.СостоянияЭЛНВРеестрахЭЛН.ПринятФСС);
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(Список, "ДатаОтправки, СостояниеОтправки, КомментарийКСостоянию");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "ЦветТекста", ЦветаСтиля.РезультатПроблемаЦвет);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "СостояниеОтправки", "=", Перечисления.СостоянияЭЛНВРеестрахЭЛН.НеПринятФСС);
	
	ФиксОтборПоГоловнойОрганизации = Параметры.Отбор.Свойство("ГоловнаяОрганизация");
	ФиксОтборПоОрганизации         = ФиксОтборПоГоловнойОрганизации Или Параметры.Отбор.Свойство("Организация");
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список", , , , , Не ФиксОтборПоОрганизации);
	Для Каждого КлючИЗначение Из Параметры.Отбор Цикл
		УдалитьОтбор(Список, КлючИЗначение.Ключ);
	КонецЦикла;
	Если ФиксОтборПоГоловнойОрганизации  Тогда
		УдалитьОтбор(Список, "Организация");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_БольничныйЛист"
		Или ИмяСобытия = "Запись_ВходящийЗапросФССДляРасчетаПособия"
		Или ИмяСобытия = "Запись_ОтветНаЗапросФССДляРасчетаПособия"
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС() Тогда
		ОтключитьОбработчикОжидания("ОбновитьСписок");
		ПодключитьОбработчикОжидания("ОбновитьСписок", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	Если Не ФиксОтборПоОрганизации Тогда
		ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Если Не ФиксОтборПоОрганизации Тогда
		ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(ТаблицаФормы, ИдентификаторСтроки, ПолеФормы, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТаблицы = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.Список.РежимВыбора Тогда
		ИменаПолей = "НомерЛисткаНетрудоспособности, Больничный, Организация, Сотрудник, ФизическоеЛицо, Отказ"; 
		РезультатВыбора = Новый Структура(ИменаПолей);
		ЗаполнитьЗначенияСвойств(РезультатВыбора, СтрокаТаблицы);
		РезультатВыбора.Отказ = Ложь;
		ОповеститьОВыборе(РезультатВыбора);
		Если Не РезультатВыбора.Отказ Тогда
			ЭлементУО = Список.УсловноеОформление.ПолучитьОбъектПоИдентификатору(ИдентификаторСпискаПодобранных);
			ЭлементУО.Отбор.Элементы[0].ПравоеЗначение.Добавить(СтрокаТаблицы.НомерЛисткаНетрудоспособности);
		КонецЕсли;
	Иначе
		Если ПолеФормы = Элементы.ПодготовленныйКОтправкеРеестр Тогда
			ОткрытьПодготовленныйКОтправкеРеестр(Неопределено);
		ИначеЕсли ПолеФормы = Элементы.ОтправленныйРеестр Тогда
			ОткрытьОтправленныйРеестр(Неопределено);
		ИначеЕсли ПолеФормы = Элементы.ПринятыйРеестр Тогда
			ОткрытьПринятыйРеестр(Неопределено);
		ИначеЕсли ПолеФормы = Элементы.ВходящийЗапрос Тогда
			ОткрытьВходящийЗапросФСС(Неопределено);
		ИначеЕсли ПолеФормы = Элементы.ОтветНаЗапрос Тогда
			ОткрытьОтветНаЗапросФСС(Неопределено);
		ИначеЕсли ПолеФормы = Элементы.Больничный
			Или ПолеФормы = Элементы.ПричинаНетрудоспособности
			Или ПолеФормы = Элементы.ПериодНетрудоспособностиНачало
			Или ПолеФормы = Элементы.ПериодНетрудоспособностиОкончание Тогда
			ОткрытьБольничный(Неопределено);
		ИначеЕсли ПолеФормы = Элементы.Сотрудник Тогда
			ПоказатьЗначениеКолонки("Сотрудник");
		ИначеЕсли ПолеФормы = Элементы.ФизическоеЛицо Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
				ПоказатьЗначениеКолонки("Сотрудник");
			Иначе
				ПоказатьЗначениеКолонки("ФизическоеЛицо");
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(ТаблицаФормы, ИдентификаторСтроки, СтандартнаяОбработка)
	СписокВыбор(ТаблицаФормы, ИдентификаторСтроки, ТекущийЭлемент, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьБольничный(Команда)
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат; // Пустая строка.
	КонецЕсли;
	СоздатьИлиОткрытьБольничный(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодготовленныйКОтправкеРеестр(Команда)
	ПоказатьЗначениеКолонки("ПодготовленныйКОтправкеРеестр");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтправленныйРеестр(Команда)
	ПоказатьЗначениеКолонки("ОтправленныйРеестр");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПринятыйРеестр(Команда)
	ПоказатьЗначениеКолонки("ПринятыйРеестр");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВходящийЗапросФСС(Команда)
	ПоказатьЗначениеКолонки("ВходящийЗапрос");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтветНаЗапросФСС(Команда)
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат; // Пустая строка.
	КонецЕсли;
	СоздатьИлиОткрытьОтветНаЗапрос(СтрокаТаблицы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписок()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойствоСпискаПоПараметруФормы(Ключ)
	Если Параметры.Свойство(Ключ) И ЗначениеЗаполнено(Параметры[Ключ]) Тогда
		Элементы.Список[Ключ] = Параметры[Ключ];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначениеКолонки(ИмяКолонки)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ссылка = ТекущаяСтрока[ИмяКолонки];
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИлиОткрытьБольничный(СтрокаТаблицы)
	ПараметрыФормы = Новый Структура("Ключ", СтрокаТаблицы.Больничный);
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.Больничный) Тогда
		ПолучитьЭЛНИзФСС = (СтрокаТаблицы.СостояниеФСС = ПредопределенноеЗначение("Перечисление.СостоянияЭЛНВФСС.Закрыт"));
		Если Не ПолучитьЭЛНИзФСС Тогда
			Текст = СтрШаблон(НСтр("ru = 'ЭЛН %1 не закрыт'"), СтрокаТаблицы.НомерЛисткаНетрудоспособности);
			ПоказатьОповещениеПользователя(Текст, , , БиблиотекаКартинок.Предупреждение24БЗК);
		КонецЕсли;
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация",                   СтрокаТаблицы.Организация);
		ЗначенияЗаполнения.Вставить("ФизическоеЛицо",                СтрокаТаблицы.ФизическоеЛицо);
		ЗначенияЗаполнения.Вставить("НомерЛисткаНетрудоспособности", СтрокаТаблицы.НомерЛисткаНетрудоспособности);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ПараметрыФормы.Вставить("ПолучитьЭЛНИзФСС",   ПолучитьЭЛНИзФСС);
	КонецЕсли;
	ОткрытьФорму("Документ.БольничныйЛист.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИлиОткрытьОтветНаЗапрос(СтрокаТаблицы)
	ПараметрыФормы = Новый Структура("Ключ", СтрокаТаблицы.ОтветНаЗапрос);
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОтветНаЗапрос) Тогда
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВходящийЗапрос) Тогда
			Текст = СтрШаблон(НСтр("ru = 'Отсутствует входящий запрос для ЭЛН %1'"), СтрокаТаблицы.НомерЛисткаНетрудоспособности);
			ПоказатьОповещениеПользователя(Текст, , , БиблиотекаКартинок.Предупреждение24БЗК);
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы.Больничный) Тогда
			Текст = СтрШаблон(НСтр("ru = 'Отсутствует больничный для ЭЛН %1'"), СтрокаТаблицы.НомерЛисткаНетрудоспособности);
			ПоказатьОповещениеПользователя(Текст, , , БиблиотекаКартинок.Предупреждение24БЗК);
		КонецЕсли;
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация",               СтрокаТаблицы.Организация);
		ЗначенияЗаполнения.Вставить("ФизическоеЛицо",            СтрокаТаблицы.ФизическоеЛицо);
		ЗначенияЗаполнения.Вставить("НомерЛН",                   СтрокаТаблицы.НомерЛисткаНетрудоспособности);
		ЗначенияЗаполнения.Вставить("ВходящийЗапрос",            СтрокаТаблицы.ВходящийЗапрос);
		ЗначенияЗаполнения.Вставить("ПервичныйДокумент",         СтрокаТаблицы.Больничный);
		ЗначенияЗаполнения.Вставить("ПричинаНетрудоспособности", СтрокаТаблицы.ПричинаНетрудоспособности);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	ОткрытьФорму("Документ.ОтветНаЗапросФССДляРасчетаПособия.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьОтбор(Список, ИмяПоля)
	Коллекции = Новый Массив;
	Коллекции.Добавить(Список.КомпоновщикНастроек.Настройки.Отбор.Элементы);
	Для Каждого Элемент Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
			Коллекции.Добавить(Элемент.Элементы);
		КонецЕсли;
	КонецЦикла;
	КоллекцияИндекс   = -1;
	КоллекцияВГраница = Коллекции.ВГраница();
	ПолеКД            = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Пока КоллекцияИндекс < КоллекцияВГраница Цикл
		КоллекцияИндекс = КоллекцияИндекс + 1;
		Коллекция = Коллекции[КоллекцияИндекс];
		ОбратныйИндекс = Коллекция.Количество();
		Пока ОбратныйИндекс > 0 Цикл
			ОбратныйИндекс = ОбратныйИндекс - 1;
			Элемент = Коллекция[ОбратныйИндекс];
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Если Элемент.ЛевоеЗначение = ПолеКД Тогда
					Коллекция.Удалить(Элемент);
				КонецЕсли;
			ИначеЕсли ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
				Коллекции.Добавить(Элемент.Элементы);
				КоллекцияВГраница = КоллекцияВГраница + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
